# Census income dataset
## Source : UCI machine learning site

In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [2]:
data = pd.read_csv("census_income_dataset.csv")
data.shape

(32561, 15)

In [3]:
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gains,capital-loss,hours-per-week,native-country,target
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
data = data.drop(["fnlwgt", "education", "relationship", "sex", "race"], axis=1)

In [5]:
data.shape

(32561, 10)

In [7]:
data.describe()

,age,education-num,capital-gains,capital-loss,hours-per-week
count,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,10.080679,1077.648844,87.303830,40.437456
std,13.640433,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.000000,0.000000,0.000000,1.000000
25%,28.000000,9.000000,0.000000,0.000000,40.000000
50%,37.000000,10.000000,0.000000,0.000000,40.000000
75%,48.000000,12.000000,0.000000,0.000000,45.000000
max,90.000000,16.000000,99999.000000,4356.000000,99.000000

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       30725 non-null  object
 2   education-num   32561 non-null  int64
 3   marital-status  32561 non-null  object
 4   occupation      30718 non-null  object
 5   capital-gains   32561 non-null  int64
 6   capital-loss    32561 non-null  int64
 7   hours-per-week  32561 non-null  int64
 8   native-country  31978 non-null  object
 9   target          32561 non-null  object
dtypes: int64(5), object(5)
memory usage: 2.5+ MB

## Description

- There are five numerical features
- and Five categorical features
- Categorical features must be converted to its numeric representation.

## Missing values

In [6]:
data.isnull().sum()

age                  0
workclass         1836
education-num        0
marital-status       0
occupation        1843
capital-gains        0
capital-loss         0
hours-per-week       0
native-country     583
target               0
dtype: int64

## Converting the qualitative values into their numeric values

## Categorical or Qualitative features
1. workclass
2. marital-status
3. occupation
4. native-country
5. target

In [11]:
# using Label encoder from sklearn
encoder = LabelEncoder()

features_to_convert = ["workclass","marital-status","occupation","native-country","target"]

In [12]:
for feature in features_to_convert:
    data[feature] = encoder.fit_transform(data[feature].astype('str'))

data.head()

,age,workclass,education-num,marital-status,occupation,capital-gains,capital-loss,hours-per-week,native-country,target
0,39,6,13,4,0,2174,0,40,38,0
1,50,5,13,2,3,0,0,13,38,0
2,38,3,9,0,5,0,0,40,38,0
3,53,3,7,2,5,0,0,40,38,0
4,28,3,13,2,9,0,0,40,4,0

## Now saving preprocessed file to new csv file

In [13]:
data.to_csv("Census_income_data_preprocessed.csv", index=False)